In [2]:
import pandas as pd
# Cria uma DataFrame
data = {"Empresa": ["GOOG","GOOG","MSFT","MSFT","FB","FB"],
        "Nome":["Sam","Charlie", "Amy","Vanessa","Carl","Sarah"],
        "Venda":[200, 120,340,124,24,350]}

In [6]:
df = pd.DataFrame(data)

In [8]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl     24
5      FB    Sarah    350

In [12]:
group = df.groupby("Empresa")

In [14]:
group

In [16]:
group.sum()

         Venda
Empresa
FB         374
GOOG       320
MSFT       464

In [18]:
group.mean()

         Venda
Empresa
FB         187
GOOG       160
MSFT       232

In [20]:
group.describe()

        Venda
        count   mean         std    min    25%    50%    75%    max
Empresa
FB        2.0  187.0  230.516811   24.0  105.5  187.0  268.5  350.0
GOOG      2.0  160.0   56.568542  120.0  140.0  160.0  180.0  200.0
MSFT      2.0  232.0  152.735065  124.0  178.0  232.0  286.0  340.0

In [22]:
group.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [24]:
group2 = df.groupby("Nome")

In [26]:
group2.sum().loc["Amy"]

Venda    340
Name: Amy, dtype: int64